---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemClassification
source: html/e6b96541-3543-44e6-753c-1f17e34fe341.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkIterator.SystemClassification Property

The optional MEP system classification where the iterations are restricted.

## Syntax (C#)
```csharp
public MEPSystemClassification SystemClassification { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration